Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFH100.PIC
      <edc:DCRDef edc:_addr="0x1FC4FFD4" edc:access="--------------------------------" edc:cname="BF1DEVCP2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1DEVCP2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFD8" edc:access="--------------------------------" edc:cname="BF1DEVCP1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1DEVCP1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFDC" edc:access="---n----------------------------" edc:cname="BF1DEVCP0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x10000000" edc:name="BF1DEVCP0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x10000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFE0" edc:access="--------------------------------" edc:cname="BF1DEVSIGN3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1DEVSIGN3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFE4" edc:access="--------------------------------" edc:cname="BF1DEVSIGN2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1DEVSIGN2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFE8" edc:access="--------------------------------" edc:cname="BF1DEVSIGN1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1DEVSIGN1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFEC" edc:access="--------------------------------" edc:cname="BF1DEVSIGN0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x0" edc:name="BF1DEVSIGN0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFF0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BF1SEQ3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="BF1SEQ3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFF4" edc:access="--------------------------------" edc:cname="BF1SEQ2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1SEQ2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFF8" edc:access="--------------------------------" edc:cname="BF1SEQ1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1SEQ1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFFC" edc:access="--------------------------------" edc:cname="BF1SEQ0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1SEQ0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1fc6ff40" edc:endaddr="0x1fc6ff80" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="altboot2config" edc:regionidref="lowerbootaliasconfig" edc:registerprefix="ABF2">
      <edc:DCRDef edc:_addr="0x1FC6FF40" edc:access="-nnnn-nn--------nnnnnnnnnnnnnnnn" edc:cname="ABF2DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x7b00ffff" edc:name="ABF2DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFFFF0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="FMIIEN" edc:desc="Ethernet RMII/MII Enable" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RMII Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MII Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FETHIO" edc:desc="Ethernet I/O Pin Select" edc:mask="0x1" edc:name="FETHIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Alternate Ethernet I/O" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Default Ethernet I/O" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FUSBIDIO" edc:desc="USB USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Controlled by Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
