Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFH100.PIC
      <edc:SFRDef edc:_addr="0x1F860250" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC3" edc:desc="" edc:mask="0x1" edc:name="CNPUC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC4" edc:desc="" edc:mask="0x1" edc:name="CNPUC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC13" edc:desc="" edc:mask="0x1" edc:name="CNPUC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC14" edc:desc="" edc:mask="0x1" edc:name="CNPUC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860260" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC3" edc:desc="" edc:mask="0x1" edc:name="CNPDC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC4" edc:desc="" edc:mask="0x1" edc:name="CNPDC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC12" edc:desc="" edc:mask="0x1" edc:name="CNPDC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC13" edc:desc="" edc:mask="0x1" edc:name="CNPDC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC14" edc:desc="" edc:mask="0x1" edc:name="CNPDC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC15" edc:desc="" edc:mask="0x1" edc:name="CNPDC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860270" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------n---n-----------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE C" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860280" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNENC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0f01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNENC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC1" edc:desc="" edc:mask="0x1" edc:name="CNIEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC2" edc:desc="" edc:mask="0x1" edc:name="CNIEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC3" edc:desc="" edc:mask="0x1" edc:name="CNIEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC4" edc:desc="" edc:mask="0x1" edc:name="CNIEC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC12" edc:desc="" edc:mask="0x1" edc:name="CNIEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC13" edc:desc="" edc:mask="0x1" edc:name="CNIEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC14" edc:desc="" edc:mask="0x1" edc:name="CNIEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC15" edc:desc="" edc:mask="0x1" edc:name="CNIEC15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860290" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC3" edc:desc="" edc:mask="0x1" edc:name="CNSTATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC4" edc:desc="" edc:mask="0x1" edc:name="CNSTATC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC12" edc:desc="" edc:mask="0x1" edc:name="CNSTATC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC13" edc:desc="" edc:mask="0x1" edc:name="CNSTATC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC14" edc:desc="" edc:mask="0x1" edc:name="CNSTATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC15" edc:desc="" edc:mask="0x1" edc:name="CNSTATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602A0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNNEC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNNEC" edc:nzwidth="32" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC1" edc:mask="0x1" edc:name="CNNEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC2" edc:mask="0x1" edc:name="CNNEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC3" edc:mask="0x1" edc:name="CNNEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC4" edc:mask="0x1" edc:name="CNNEC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC12" edc:mask="0x1" edc:name="CNNEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC13" edc:mask="0x1" edc:name="CNNEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC14" edc:mask="0x1" edc:name="CNNEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC15" edc:mask="0x1" edc:name="CNNEC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602B0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNFC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNFC" edc:nzwidth="32" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC1" edc:mask="0x1" edc:name="CNFC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC2" edc:mask="0x1" edc:name="CNFC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC3" edc:mask="0x1" edc:name="CNFC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC4" edc:mask="0x1" edc:name="CNFC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC12" edc:mask="0x1" edc:name="CNFC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC13" edc:mask="0x1" edc:name="CNFC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC14" edc:mask="0x1" edc:name="CNFC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC15" edc:mask="0x1" edc:name="CNFC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8602C0" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F860300" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nn--------------" edc:cname="ANSELD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffc000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------11--------------" edc:name="ANSELD" edc:nzwidth="0x20" edc:por="----------------11--------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSD14" edc:desc="" edc:mask="0x1" edc:name="ANSD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSD15" edc:desc="" edc:mask="0x1" edc:name="ANSD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860310" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="TRISD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111---111111" edc:name="TRISD" edc:nzwidth="0x20" edc:por="----------------1111111---111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISD0" edc:desc="" edc:mask="0x1" edc:name="TRISD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD1" edc:desc="" edc:mask="0x1" edc:name="TRISD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD2" edc:desc="" edc:mask="0x1" edc:name="TRISD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD3" edc:desc="" edc:mask="0x1" edc:name="TRISD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD4" edc:desc="" edc:mask="0x1" edc:name="TRISD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD5" edc:desc="" edc:mask="0x1" edc:name="TRISD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISD9" edc:desc="" edc:mask="0x1" edc:name="TRISD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD10" edc:desc="" edc:mask="0x1" edc:name="TRISD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD11" edc:desc="" edc:mask="0x1" edc:name="TRISD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD12" edc:desc="" edc:mask="0x1" edc:name="TRISD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD13" edc:desc="" edc:mask="0x1" edc:name="TRISD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD14" edc:desc="" edc:mask="0x1" edc:name="TRISD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD15" edc:desc="" edc:mask="0x1" edc:name="TRISD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860320" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn---nnnnnn" edc:cname="PORTD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffe3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxx---xxxxxx" edc:name="PORTD" edc:nzwidth="0x20" edc:por="----------------xxxxxxx---xxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RD9" edc:desc="" edc:mask="0x1" edc:name="RD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD10" edc:desc="" edc:mask="0x1" edc:name="RD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD11" edc:desc="" edc:mask="0x1" edc:name="RD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD12" edc:desc="" edc:mask="0x1" edc:name="RD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD13" edc:desc="" edc:mask="0x1" edc:name="RD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD14" edc:desc="" edc:mask="0x1" edc:name="RD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD15" edc:desc="" edc:mask="0x1" edc:name="RD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
